defeatComment = {
        "\033[31mhp\033[0m 부족" : [
                 "아아...",
                 "이건 아니야.",
                 "난 이런 걸 원하지 않았어.",
                 "나한테 도대체 왜 그러는 거야...",
                 "또 다시 한 번...",
                 "숨을 쉴 수가 없어...",
                 "온 몸이 뜨거워..."
        ],
        "\033[33m허기\033[0m 부족" : [
                 "아아...",
                 "나의 고향... 나의...",
                 "아직 부족해.",
                 "이건 거짓말이야.. 내, 내가..?",
                 "나한테 도대체 왜 그러는 거야...",
                 "너무 배고파...",
                 "움직일 힘이 없어..."
        ]
}

victoryComment = [
                  "나쁘지 않군.",
                  "그래 이거야..",
                  "또 같은 게 반복되겠군. 내려가고 또 내려가고...",
                  "난 죄가 없어...",
                  "온 몸이 꼬챙이로 쑤셔지는 느낌이야..",
                  "하하하하하! 찢고 죽인다!!",
                  "으, 이러다가 나도 편린의 일부가 되겠어.",
                  "이번에도... 아주 거지같은 한 판이었어.",
                  "말도 못 할 만큼 즐거운 나락이었다."
                 ]